АлогистикТест2/src/DataProcessors/алк_РМ_Пропарка/алк_РМ_Пропарка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_Пропарка</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_СтатусПропарки/алк_СтатусПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СтатусПропарки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_ОперацииПропарки</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_РапортПропарка/алк_РапортПропарка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РапортПропарка</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <registerRecords>InformationRegister.алк_ВремяПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Камеры</name>
    <attributes>
      <name>КамераСсылка</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаНачало</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаКонец</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаНачало</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаКонец</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаНачало</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаКонец</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаНачало</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаКонец</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаНачало</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаКонец</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачалоСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазгрузилиОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонецСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляДвижений</name>
    <attributes>
      <name>Камера</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.алк_СменыШпон</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОжидаемое</name>
      <comment>Для контроля состояния камеры при записо документа</comment>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_РМ_Пропарка/Forms/РабочееМесто/Module.bsl
&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СтатусПропаркиСрезПоследних.Период,
		|	алк_СтатусПропаркиСрезПоследних.Регистратор,
		|	алк_СтатусПропаркиСрезПоследних.КамераПропарки КАК Камера,
		|	алк_СтатусПропаркиСрезПоследних.Статус КАК Статус,
		|	алк_СтатусПропаркиСрезПоследних.ВремяНачала,
		|	алк_СтатусПропаркиСрезПоследних.ВремяОкончанияПлан КАК ВремяОкончания
		|ИЗ
		|	РегистрСведений.алк_СтатусПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_СтатусПропаркиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_СтатусПропаркиСрезПоследних.КамераПропарки.Код";
	
	Запрос.УстановитьПараметр("ДатаСреза", ВремяОбновления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатусыКамер.Загрузить(РезультатЗапроса.Выгрузить());
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
       

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ВремяОбновления = ТекущаяДата();
	
	ОбновитьСтатусыНаСервере();  
		
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьРегистратор(Команда)
	
	Если Не Элементы.СтатусыКамер.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(,Элементы.СтатусыКамер.ТекущиеДанные.Регистратор); 
	Иначе
		Сообщить("Требуется выбрать строку из таблицы.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйСтатус(Команда)  
		
	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаДокумента");
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусНаДату(Команда)
	
   Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);	
 
    ПоказатьВводДаты(
        Оповещение,
		ТекущаяДата(),
        "Введите дату и время", 
        ЧастиДаты.ДатаВремя
    );    
   
КонецПроцедуры

  
&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
 
    Если Не Дата = Неопределено Тогда
       ВремяОбновления = Дата;    
	   ОбновитьСтатусыНаСервере();
   КонецЕсли;   
 
КонецПроцедуры
